mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xh/s6e2c5xh.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BT0" -->
    <peripheral>
      <name>BT0</name>
      <description>Base Timer 0</description>
      <version>A</version>
      <groupName>BT</groupName>
      <baseAddress>0x40025000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "BT0" -->
      <interrupt>
        <name>BT0</name>
        <value>39</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PWM_TMCR" -->
        <register>
          <name>PWM_TMCR</name>
          <description>Timer Control Register [BHW]</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS" -->
            <field>
              <name>CKS</name>
              <description>Count clock selection bit</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTGEN" -->
            <field>
              <name>RTGEN</name>
              <description>Restart enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PMSK" -->
            <field>
              <name>PMSK</name>
              <description>Pulse output mask bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description>Trigger input edge selection bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description>Timer function selection bits</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSEL" -->
            <field>
              <name>OSEL</name>
              <description>Output polarity specification bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description>Mode selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description>Count operation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG" -->
            <field>
              <name>STRG</name>
              <description>Software trigger bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_TMCR2" -->
        <register>
          <name>PWM_TMCR2</name>
          <description>Timer Control Register 2 [BHW]</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description>Count clock selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_STC" -->
        <register>
          <name>PWM_STC</name>
          <description> Status Control Register [BHW]</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGIE" -->
            <field>
              <name>TGIE</name>
              <description>Trigger interrupt request enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIE" -->
            <field>
              <name>DTIE</name>
              <description>Duty match interrupt request enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIE" -->
            <field>
              <name>UDIE</name>
              <description>Underflow interrupt request enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGIR" -->
            <field>
              <name>TGIR</name>
              <description>Trigger interrupt request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIR" -->
            <field>
              <name>DTIR</name>
              <description>Duty match interrupt request bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIR" -->
            <field>
              <name>UDIR</name>
              <description>Underflow interrupt request bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_PCSR" -->
        <register>
          <name>PWM_PCSR</name>
          <description>PWM Cycle Set Register [HW]</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
