mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xh/s6e2c5xh.svd
        <!-- REGISTER "TXBC" -->
        <register>
          <name>TXBC</name>
          <description>Tx Buffer Configuration [BHW]</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F3FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TFQM" -->
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFQS" -->
            <field>
              <name>TFQS</name>
              <description>Transmit FIFO/Queue Size</description>
              <msb>29</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NDTB" -->
            <field>
              <name>NDTB</name>
              <description>Number of Dedicated Transmit Buffers</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBSA" -->
            <field>
              <name>TBSA</name>
              <description>Tx Buffers Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFQS" -->
        <register>
          <name>TXFQS</name>
          <description>Tx FIFO/Queue Status [BHW]</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F1F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TFQF" -->
            <field>
              <name>TFQF</name>
              <description>Tx FIFO/Queue Full</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFQPI" -->
            <field>
              <name>TFQPI</name>
              <description>Tx FIFO/Queue Put Index</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFGI" -->
            <field>
              <name>TFGI</name>
              <description>Tx FIFO Get Index</description>
              <msb>12</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFFL" -->
            <field>
              <name>TFFL</name>
              <description>Tx FIFO Free Level</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXESC" -->
        <register>
          <name>TXESC</name>
          <description>Tx Buffer Element Size Configuration [BHW]</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBDS" -->
            <field>
              <name>TBDS</name>
              <description>Tx Buffer Data Field Size</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBRP" -->
        <register>
          <name>TXBRP</name>
          <description>Tx Buffer Request Pending [BHW]</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRP31" -->
            <field>
              <name>TRP31</name>
              <description>Transmission Request Pending of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP30" -->
            <field>
              <name>TRP30</name>
              <description>Transmission Request Pending of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP29" -->
            <field>
              <name>TRP29</name>
              <description>Transmission Request Pending of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP28" -->
            <field>
              <name>TRP28</name>
              <description>Transmission Request Pending of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP27" -->
            <field>
              <name>TRP27</name>
              <description>Transmission Request Pending of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP26" -->
            <field>
              <name>TRP26</name>
              <description>Transmission Request Pending of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP25" -->
            <field>
              <name>TRP25</name>
              <description>Transmission Request Pending of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP24" -->
            <field>
              <name>TRP24</name>
              <description>Transmission Request Pending of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP23" -->
            <field>
              <name>TRP23</name>
              <description>Transmission Request Pending of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP22" -->
            <field>
              <name>TRP22</name>
              <description>Transmission Request Pending of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP21" -->
            <field>
              <name>TRP21</name>
              <description>Transmission Request Pending of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP20" -->
            <field>
              <name>TRP20</name>
              <description>Transmission Request Pending of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP19" -->
            <field>
              <name>TRP19</name>
              <description>Transmission Request Pending of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP18" -->
            <field>
              <name>TRP18</name>
              <description>Transmission Request Pending of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP17" -->
            <field>
              <name>TRP17</name>
              <description>Transmission Request Pending of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP16" -->
            <field>
              <name>TRP16</name>
              <description>Transmission Request Pending of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP15" -->
            <field>
              <name>TRP15</name>
              <description>Transmission Request Pending of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP14" -->
            <field>
              <name>TRP14</name>
              <description>Transmission Request Pending of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP13" -->
            <field>
              <name>TRP13</name>
              <description>Transmission Request Pending of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP12" -->
            <field>
              <name>TRP12</name>
              <description>Transmission Request Pending of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP11" -->
            <field>
              <name>TRP11</name>
              <description>Transmission Request Pending of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP10" -->
            <field>
              <name>TRP10</name>
              <description>Transmission Request Pending of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP9" -->
            <field>
              <name>TRP9</name>
              <description>Transmission Request Pending of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP8" -->
            <field>
              <name>TRP8</name>
              <description>Transmission Request Pending of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP7" -->
            <field>
              <name>TRP7</name>
              <description>Transmission Request Pending of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP6" -->
            <field>
              <name>TRP6</name>
              <description>Transmission Request Pending of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP5" -->
            <field>
              <name>TRP5</name>
              <description>Transmission Request Pending of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP4" -->
            <field>
              <name>TRP4</name>
              <description>Transmission Request Pending of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP3" -->
            <field>
              <name>TRP3</name>
              <description>Transmission Request Pending of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP2" -->
            <field>
              <name>TRP2</name>
              <description>Transmission Request Pending of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP1" -->
            <field>
              <name>TRP1</name>
              <description>Transmission Request Pending of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP0" -->
            <field>
              <name>TRP0</name>
              <description>Transmission Request Pending of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBAR" -->
        <register>
          <name>TXBAR</name>
          <description>Tx Buffer Add Request [BHW]</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AR31" -->
            <field>
              <name>AR31</name>
              <description>Add Request of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR30" -->
            <field>
              <name>AR30</name>
              <description>Add Request of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR29" -->
            <field>
              <name>AR29</name>
              <description>Add Request of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR28" -->
            <field>
              <name>AR28</name>
              <description>Add Request of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR27" -->
            <field>
              <name>AR27</name>
              <description>Add Request of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR26" -->
            <field>
              <name>AR26</name>
              <description>Add Request of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR25" -->
            <field>
              <name>AR25</name>
              <description>Add Request of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR24" -->
            <field>
              <name>AR24</name>
              <description>Add Request of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR23" -->
            <field>
              <name>AR23</name>
              <description>Add Request of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR22" -->
            <field>
              <name>AR22</name>
              <description>Add Request of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR21" -->
            <field>
              <name>AR21</name>
              <description>Add Request of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR20" -->
            <field>
              <name>AR20</name>
              <description>Add Request of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR19" -->
            <field>
              <name>AR19</name>
              <description>Add Request of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR18" -->
            <field>
              <name>AR18</name>
              <description>Add Request of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR17" -->
            <field>
              <name>AR17</name>
              <description>Add Request of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR16" -->
            <field>
              <name>AR16</name>
              <description>Add Request of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR15" -->
            <field>
              <name>AR15</name>
              <description>Add Request of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR14" -->
            <field>
              <name>AR14</name>
              <description>Add Request of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR13" -->
            <field>
              <name>AR13</name>
              <description>Add Request of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR12" -->
            <field>
              <name>AR12</name>
              <description>Add Request of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR11" -->
            <field>
              <name>AR11</name>
              <description>Add Request of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR10" -->
            <field>
              <name>AR10</name>
              <description>Add Request of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR9" -->
            <field>
              <name>AR9</name>
              <description>Add Request of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR8" -->
            <field>
              <name>AR8</name>
              <description>Add Request of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR7" -->
            <field>
              <name>AR7</name>
              <description>Add Request of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR6" -->
            <field>
              <name>AR6</name>
              <description>Add Request of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR5" -->
            <field>
              <name>AR5</name>
              <description>Add Request of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR4" -->
            <field>
              <name>AR4</name>
              <description>Add Request of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR3" -->
            <field>
              <name>AR3</name>
              <description>Add Request of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR2" -->
            <field>
              <name>AR2</name>
              <description>Add Request of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR1" -->
            <field>
              <name>AR1</name>
              <description>Add Request of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR0" -->
            <field>
              <name>AR0</name>
              <description>Add Request of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
