mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xh/s6e2c5xh.svd
        <!-- REGISTER "TXBCIE" -->
        <register>
          <name>TXBCIE</name>
          <description>Tx Buffer Cancellation Finished Interrupt Enable [BHW]</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CFIE31" -->
            <field>
              <name>CFIE31</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE30" -->
            <field>
              <name>CFIE30</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE29" -->
            <field>
              <name>CFIE29</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE28" -->
            <field>
              <name>CFIE28</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE27" -->
            <field>
              <name>CFIE27</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE26" -->
            <field>
              <name>CFIE26</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE25" -->
            <field>
              <name>CFIE25</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE24" -->
            <field>
              <name>CFIE24</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE23" -->
            <field>
              <name>CFIE23</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE22" -->
            <field>
              <name>CFIE22</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE21" -->
            <field>
              <name>CFIE21</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE20" -->
            <field>
              <name>CFIE20</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE19" -->
            <field>
              <name>CFIE19</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE18" -->
            <field>
              <name>CFIE18</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE17" -->
            <field>
              <name>CFIE17</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE16" -->
            <field>
              <name>CFIE16</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE15" -->
            <field>
              <name>CFIE15</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE14" -->
            <field>
              <name>CFIE14</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE13" -->
            <field>
              <name>CFIE13</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE12" -->
            <field>
              <name>CFIE12</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE11" -->
            <field>
              <name>CFIE11</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE10" -->
            <field>
              <name>CFIE10</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE9" -->
            <field>
              <name>CFIE9</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE8" -->
            <field>
              <name>CFIE8</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE7" -->
            <field>
              <name>CFIE7</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE6" -->
            <field>
              <name>CFIE6</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE5" -->
            <field>
              <name>CFIE5</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE4" -->
            <field>
              <name>CFIE4</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE3" -->
            <field>
              <name>CFIE3</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE2" -->
            <field>
              <name>CFIE2</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE1" -->
            <field>
              <name>CFIE1</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE0" -->
            <field>
              <name>CFIE0</name>
              <description>Cancellation Finished Interrupt Enable of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
