mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xh/s6e2c5xh.svd
        <!-- REGISTER "FDSEAR" -->
        <register>
          <name>FDSEAR</name>
          <description>CAN FD ECC Single-bit Error Address Register [BHW]</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRA" -->
            <field>
              <name>SRA</name>
              <description>Single-bit error Message RAM address bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESCR" -->
        <register>
          <name>FDESCR</name>
          <description>CAN FD ECC Error Status Clear Register [BHW]</description>
          <addressOffset>0x205</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEIC" -->
            <field>
              <name>DEIC</name>
              <description>Double-bit error clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SEIC" -->
            <field>
              <name>SEIC</name>
              <description>Sngle-bit error clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDDEAR" -->
        <register>
          <name>FDDEAR</name>
          <description>CAN FD ECC Double-bit Error Address Register [BHW]</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRA" -->
            <field>
              <name>DRA</name>
              <description>Double-bit error Message RAM address bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCNTR" -->
        <register>
          <name>TSCNTR</name>
          <description>Time Stamp Control Register [BHW]</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CCLR" -->
            <field>
              <name>CCLR</name>
              <description>Counter clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSMDR" -->
        <register>
          <name>TSMDR</name>
          <description>Time Stamp Mode Register [BHW]</description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNTEN" -->
            <field>
              <name>CNTEN</name>
              <description>Counter enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSDIVR" -->
        <register>
          <name>TSDIVR</name>
          <description>Time Stamp Divider Register [BHW]</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description>Counter clock division ratio setting bit</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCDTR" -->
        <register>
          <name>TSCDTR</name>
          <description>Time Stamp Counter Data Register [BHW]</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNT" -->
            <field>
              <name>CNT</name>
              <description>Counter value bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCPCLR" -->
        <register>
          <name>TSCPCLR</name>
          <description>Time Stamp Compare Clear Register [BHW]</description>
          <addressOffset>0x21A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMP" -->
            <field>
              <name>CMP</name>
              <description>Compare clear setting bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
